app/controllers/cars_controller.rb

SELECT * FROM "cars" WHERE ("cars"."model_id" = '3')
SELECT * FROM "cars" WHERE ("cars"."trim" = '7') LIMIT 1
SELECT * FROM "models" WHERE ("models"."id" = 1)
SELECT * FROM "cars" LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "cars"
---
  def index

    @json_cars = Car.find_all_by_model_id(params[:model_id]) unless params[:model_id].nil?
    @json_cars = Car.find(params[:trim_id]) unless params[:trim_id].nil?

    @cars = Car.paginate(:page => params[:page], :per_page => CARS_PER_PAGE)